{"pages":[{"title":"一个网络工程师的自述","text":"### 关于我 一个资深网络工程师. 长期从事网络运维工作，对网络管理有点心得，希望能够通过这个博客分享给大家。在工作中，积累了大量的实施工作经验。我系统地掌握了网络安全和系统安全方面的技术，涉及到服务器，防火墙，路由交换技术的配置和安全防护，能够独立处理非常规性网络异常，特别是针对因黑客攻击所引发的安全事故有一定的处理经验，熟练使用绿盟，天融信，深信服，启明星辰等主流网络安全厂商的安全设备，如：IPS，WAF，TAC，RSAS，上网行为管理器，防火墙设备。 在网络自动化运维管理中，自己编写一款网络设备自动化运维工具软件，给自己在工作中节省很多时间，也希望给各位好友一起使用，因为需要对软件进行定制开发，更新，所以采取了授权方式，一个工程师版本的3年授权300元，欢迎大家联系，针对企业提供定制开发。(本网站作为唯一官方发布地址) 联系方式QQ: 313712640E-Mail: liusancai@aliyun.com个人博客: https://liusancai.github.io/工具下载(博客所有分享文件)：百度网盘: https://pan.baidu.com/s/1ogJjQkG7K3Og42kk-DHZEQ 提取码: cgv5","link":"/about/index.html"}],"posts":[{"title":"网络设备自动备份","text":"## 一、软件介绍 随着企业信息化的发展，更多的业务依赖于网络，核心业务对网络的要求更加的高，作为企业的网络管理人员，面对的大量的网络设备，造成了日常维护工作量大，没有有效的方式进行统一管理配置，不能快速的定位网络故障点，更新配置时需要手动登录交换机一台台的操作，给日常运维带来了很大的挑战。 虽然市场上有着成熟的网管软件，但是存在价格昂贵，部署复杂，自定义内容的配置少，不够自定义巡检内容，不能够批量下发配置等功能限制，导致很多企业的网管还是处在初期的人工手动维护状态，本软件具有程序小，无需部署，无需安装，使用方便等特点，主要功能如下： 1. 批量巡检 1. 自定义巡检 1. 批量关闭空闲端口 1. 批量开启全部端口 1. 配置端口安全功能 1. 批量保存配置 目前软件支持市场长大部分厂家设备，华为，华三，思科，锐捷，中兴，博达，迈普，贝尔等8个厂商的设备。软件支持二次定制开发，根据网络中的设备进行匹配。 ![工具主界面](/images/主图.png) ## 二、软件功能 - 批量巡检功能自动登录网络设备，执行命令，形成日志文件后，分析文件生成巡检报告，报告内容包含单台网络设备的启动设备，设备版本，风扇，电源，cpu，内存使用率等，对在网的所有设备的mac地址表和arp表进行整合表格，方便了解网络设备和终端设备的信息。只有日常巡检能够生成报表，其他功能无报表。 - 自定义巡检功能能够根据自定义的命令对交换机下发配置命令，打开conf文件夹下的各厂商配置文件，在def=字段后面输入本次需要执行的命令即可。 - 批量关端空闲端口，通过运行交换机查看mac地址的命令，进行分析端口下的mac地址情况，对于没有使用的端口进行自动关闭操作。 - 批量开启全部端口，通过分析设备的运行配置分析出设备的所有端口，根据分析出的端口列表，自动进入端口模式，执行开启端口操作。 - 配置端口安全功能是根据分析端口下的配置信息，mac地址信息，自动根据预设好的端口安全配置方式，进行全网设备的统一配置。 - 批量保存配置功能是根据设备列表登录到设备中，执行保存配置的命令，为了防止配置丢失导致的网络故障。 ## 三、使用准备 使用软件之前，需要准备一个设备列表的excel文件，按照示例内容填写。主要如下： 序号 IP 用户名 密码 特权密码 厂商 端口 设备功能 站点名称 备注 1 192.168.1.1 user password rootword h3c 22 switch 测试1 2 192.168.1.2 user password h3c 22 router 测试2 提示：该文件保存了设备的用户密码信息，请管理员妥善保管此文件，防止文件泄露，造成网络信息安全问题。 定制功能使用前先测试，各位工程师的配置不太一样。 ![巡检表结果]( /images/巡检表.png ) 下载地址：百度网盘 链接: https://pan.baidu.com/s/1DXoZdMQ3SXuCHEy_HB5J_w 本软件采用离线授权的方式，具体费用请联系作者","link":"/2020/01/30/switch-back/"}],"tags":[{"name":"交换机","slug":"交换机","link":"/tags/%E4%BA%A4%E6%8D%A2%E6%9C%BA/"},{"name":"备份","slug":"备份","link":"/tags/%E5%A4%87%E4%BB%BD/"}],"categories":[]}